In [1]:
#For SQL

In [12]:
import pandas as pd
import numpy as np

In [8]:
from sqlalchemy import create_engine

In [11]:
temp_db = create_engine('sqlite:///:memory:') #temporary db

In [23]:
df =pd.DataFrame(data=np.random.randint(low=0,high=100,size=(4,4)),columns=['a','b','c','d'])

In [24]:
df

    a   b   c   d
0  13  90  42  90
1  49  95  43  81
2  83  79   9  40
3  38  62  40  38

In [25]:
df.to_sql(name='new_table',con=temp_db) #Naming

4

In [26]:
new_df = pd.read_sql(sql='new_table',con=temp_db)

In [27]:
new_df

   index   a   b   c   d
0      0  13  90  42  90
1      1  49  95  43  81
2      2  83  79   9  40
3      3  38  62  40  38

In [29]:
pd.read_sql_query(sql='select a,c from new_table',con=temp_db)

    a   c
0  13  42
1  49  43
2  83   9
3  38  40